Behavioral/SignalNoise/SignalNoise.org
#+STARTUP: beamer 
#+LATEX_CLASS: beamer
#+BEAMER_THEME: Montpellier
#+LaTeX_CLASS_OPTIONS: [bigger]
#+OPTIONS: H:3 toc:nil
#+toc: nil
#+TITLE: The Signal and the Noise
#+AUTHOR: Timothy Schwieg
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

* Introduction 

*** Prediction

- Separate Signal from the Noise
- We're Mostly bad at this. Very Bad
- Information Overload  Printing Press
- Productivity Paradox  Information Age

* Prediction - Where it works and where it doesn't
** The Great Recession

*** Rating Agencies 
- Forecasted the risk of CDOs at 0.12\%
- Actual Default Rate at 28\%
- Rating Quality had little effect on their profits
- Benefited almost solely from rating securities
- Simulated under assumptions and missed risk they were taking


*** Risk and Uncertainty
- Depending on the Dependence structure of the underlying assets,
  bundled securities can be much less or more risky than under
  assumptions such as independence.
- The Nature of the dependence is not known - Knightian Uncertainty
- Rating agencies claimed this uncertainty was risk - Moody's
  increased their estimate of default by 50\%. Which did nothing to
  mollify.

*** Prediction in the Housing Bubble

- Homeowners assumed the prices would continue to rise -ignoring the
  bubble
- Banks and rating agencies did not understand the system risk present
- Economists did not understand how the leveraged bank sector was tied
  to the housing market
- Policy makers were overconfident in the rate of Recovery of the
  Economy - basing it falsely on recessions instead of financial
  crises.

*** Understanding Your Sample
- Should you Drunk Drive or Call Uber?
- Can we trust Rating Agencies to know how to rate new assets?
- You should always use your sample to avoid false confidence

** Political Predictions

*** McLaughlin Show
- Predictions occur at the final part of the episode
- Regardless of Political Affiliation, no guess is any better than 50%
- However the Predictions are structured with 75z% of them being
  completely false or Completely true

*** Political Scientists
- Almost nobody correctly predicted the Collapse of the Soviet Union
- Required piecing together structural problems with Soviet union and
  Gorbachev's motivations for reform.
- Poor estimates of Soviet GDP and its decline
- However this isn't unique to the Soviet Union - most political
  scientists are terrible at predicting anything.
- In fact, the ones that speak to the media do worse than ones that don't

*** Foxes vs Hedgehogs
- "The Fox knows many little things, but the hedgehog knows one big
  thing." - Archilochus
- Hedgehogs - Big ideas that govern all motion around us. Think Karl
  Marx
- Foxes - little ideas explain a little of an issue, but many of them
  combine to explain the picture. Usually multidisciplinary, cautious
  and empirical, as well as tolerant of complexity.
- Hedgehogs however make much better television guests, and receive
  the lion's share of publicity despite being worse at predictions.

*** Lessons from Hedgehogs
- Hedgehogs get worse at predicting as they get more experience
- They are letting their biases take over their prediction
- This occurs with television pundits and partisanship. 
- Don't construct narratives, these become less like reality the more
  information you get, and become worse predictors.

*** How to Apply this to Prediction
- Think Probabilistically ( Bayesian v Frequentist )
- Keep making forecasts and don't let the past affect today's prediction
- Consensus is a good sign, but not always
- There is no single data point that is sufficient for a complex
  system.
- Weigh Quantitative and Qualitative data together - Cook Political
  Report.

** Baseball

*** What makes baseball so easy to predict
- There is a lot of good data
- Play is largely independent. Players responsible for their own
  statistics
- Relatively few problems with complexity or dynamics
- We understand the processes underlying the data
- Easy to account for unobserved heterogeneity.

*** PECOTA isn't God's gift to scouting
- Outclassed by Professional scouting in predicting players' ability
  from minor to major league.
- A hybrid approach is the best predictive measure. 
- Especially since there is interdependence between certain aspects
  (Pitchers in minor leagues aren't playing against great hitters).
- Bias can happen in statistical models - Billy Beane had bad
  defenses.

*** Don't Limit the Data
- Being able to combine qualitative information is important for
  prediction
- Baseball scouts exist to find out this information and bring to
  attention
- Beware of discounting something we can't categorize easily such as
  the tool kit of Dustin Pedroia

** Weather Prediction - A Success Story

*** Predicting Weather
- Laplace's Demon - If you knew the exact state of the universe and
  all the laws of motion, we could predict perfectly.
- While this may be false, if we know the laws of motion and know the
  states of the universe, we're going to make pretty good predictions.
- Weather is something that we understand the underlying motion very well.
- We don't however know the state of every molecule in Earth's atmosphere

*** Predicting Weather
- We can however, discretize space and apply equations to data
  gathered. First attempted by Lewis Richardson
- However there is a lot of number crunching, so computers are pretty
  much required.
- However, as you become more precise in the discretization of the
  atmosphere, there is a computational cost. Doubling Precision
  increases the grid by 16 times as much.
- However this is a dynamic system, with one dimension being time, and
  we are not very good at predicting these.

*** Chaos Theory
- Applies to non-linear dynamic systems. 
- Tiny changes in the initial conditions can have huge consequences in
  the outcomes, even in a completely deterministic model.
- This means measurement error, and human error can have huge
  consequences in the predictions.
- This is handled by perturbation of the initial conditions and simulation.

*** The Human Touch
- It doesn't end there, there is still a human element to weather predictions. 
- Humans attempt to account for mistakes that the computer may make,
  through their intuition about the machinations of the model.
- This is true because humans are much better still at visually
  identifying patterns and can correct for it much better than a
  computer can. 
- This can lead to problems such as over fitting, but meteorologists
  improve predictions by about 25%, and predictions keep improving

*** Evaluating a Forecast
- Industry competition is not always seeking a more precise forecast,
  but a more useful one.
- The Economist's view on the Receiver Operating Curve.
- This can lead to dishonest predictions that are not necessarily bad,
  they simply are responding to other objectives.
- Be aware of goals other than strictly reporting truth.


