Behavioral/SignalNoise/SignalNoise.tex
% Created 2018-03-30 Fri 20:22
\documentclass[bigger]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usetheme{Montpellier}
\author{Timothy Schwieg}
\date{\today}
\title{The Signal and the Noise}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.1.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle

\section{Introduction}
\label{sec-1}

\begin{frame}[label=sec-1-0-1]{Prediction}
\begin{itemize}
\item Separate Signal from the Noise
\item We're Mostly bad at this. Very Bad
\item Information Overload  Printing Press
\item Productivity Paradox  Information Age
\end{itemize}
\end{frame}

\section{Prediction - Where it works and where it doesn't}
\label{sec-2}
\subsection{The Great Recession}
\label{sec-2-1}

\begin{frame}[label=sec-2-1-1]{Rating Agencies}
\begin{itemize}
\item Forecasted the risk of CDOs at 0.12\%
\item Actual Default Rate at 28\%
\item Rating Quality had little effect on their profits
\item Benefited almost solely from rating securities
\item Simulated under assumptions and missed risk they were taking
\end{itemize}
\end{frame}


\begin{frame}[label=sec-2-1-2]{Risk and Uncertainty}
\begin{itemize}
\item Depending on the Dependence structure of the underlying assets,
bundled securities can be much less or more risky than under
assumptions such as independence.
\item The Nature of the dependence is not known - Knightian Uncertainty
\item Rating agencies claimed this uncertainty was risk - Moody's
increased their estimate of default by 50\%. Which did nothing to
mollify.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-1-3]{Prediction in the Housing Bubble}
\begin{itemize}
\item Homeowners assumed the prices would continue to rise -ignoring the
bubble
\item Banks and rating agencies did not understand the system risk present
\item Economists did not understand how the leveraged bank sector was tied
to the housing market
\item Policy makers were overconfident in the rate of Recovery of the
Economy - basing it falsely on recessions instead of financial
crises.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-1-4]{Understanding Your Sample}
\begin{itemize}
\item Should you Drunk Drive or Call Uber?
\item Can we trust Rating Agencies to know how to rate new assets?
\item You should always use your sample to avoid false confidence
\end{itemize}
\end{frame}

\subsection{Political Predictions}
\label{sec-2-2}

\begin{frame}[label=sec-2-2-1]{McLaughlin Show}
\begin{itemize}
\item Predictions occur at the final part of the episode
\item Regardless of Political Affiliation, no guess is any better than 50\%
\item However the Predictions are structured with 75z\% of them being
completely false or Completely true
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-2-2]{Political Scientists}
\begin{itemize}
\item Almost nobody correctly predicted the Collapse of the Soviet Union
\item Required piecing together structural problems with Soviet union and
Gorbachev's motivations for reform.
\item Poor estimates of Soviet GDP and its decline
\item However this isn't unique to the Soviet Union - most political
scientists are terrible at predicting anything.
\item In fact, the ones that speak to the media do worse than ones that don't
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-2-3]{Foxes vs Hedgehogs}
\begin{itemize}
\item "The Fox knows many little things, but the hedgehog knows one big
thing." - Archilochus
\item Hedgehogs - Big ideas that govern all motion around us. Think Karl
Marx
\item Foxes - little ideas explain a little of an issue, but many of them
combine to explain the picture. Usually multidisciplinary, cautious
and empirical, as well as tolerant of complexity.
\item Hedgehogs however make much better television guests, and receive
the lion's share of publicity despite being worse at predictions.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-2-4]{Lessons from Hedgehogs}
\begin{itemize}
\item Hedgehogs get worse at predicting as they get more experience
\item They are letting their biases take over their prediction
\item This occurs with television pundits and partisanship.
\item Don't construct narratives, these become less like reality the more
information you get, and become worse predictors.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-2-5]{How to Apply this to Prediction}
\begin{itemize}
\item Think Probabilistically ( Bayesian v Frequentist )
\item Keep making forecasts and don't let the past affect today's prediction
\item Consensus is a good sign, but not always
\item There is no single data point that is sufficient for a complex
system.
\item Weigh Quantitative and Qualitative data together - Cook Political
Report.
\end{itemize}
\end{frame}

\subsection{Baseball}
\label{sec-2-3}

\begin{frame}[label=sec-2-3-1]{What makes baseball so easy to predict}
\begin{itemize}
\item There is a lot of good data
\item Play is largely independent. Players responsible for their own
statistics
\item Relatively few problems with complexity or dynamics
\item We understand the processes underlying the data
\item Easy to account for unobserved heterogeneity.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-3-2]{PECOTA isn't God's gift to scouting}
\begin{itemize}
\item Outclassed by Professional scouting in predicting players' ability
from minor to major league.
\item A hybrid approach is the best predictive measure.
\item Especially since there is interdependence between certain aspects
(Pitchers in minor leagues aren't playing against great hitters).
\item Bias can happen in statistical models - Billy Beane had bad
defenses.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-3-3]{Don't Limit the Data}
\begin{itemize}
\item Being able to combine qualitative information is important for
prediction
\item Baseball scouts exist to find out this information and bring to
attention
\item Beware of discounting something we can't categorize easily such as
the tool kit of Dustin Pedroia
\end{itemize}
\end{frame}

\subsection{Weather Prediction - A Success Story}
\label{sec-2-4}

\begin{frame}[label=sec-2-4-1]{Predicting Weather}
\begin{itemize}
\item Laplace's Demon - If you knew the exact state of the universe and
all the laws of motion, we could predict perfectly.
\item While this may be false, if we know the laws of motion and know the
states of the universe, we're going to make pretty good predictions.
\item Weather is something that we understand the underlying motion very well.
\item We don't however know the state of every molecule in Earth's atmosphere
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-4-2]{Predicting Weather}
\begin{itemize}
\item We can however, discretize space and apply equations to data
gathered. First attempted by Lewis Richardson
\item However there is a lot of number crunching, so computers are pretty
much required.
\item However, as you become more precise in the discretization of the
atmosphere, there is a computational cost. Doubling Precision
increases the grid by 16 times as much.
\item However this is a dynamic system, with one dimension being time, and
we are not very good at predicting these.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-4-3]{Chaos Theory}
\begin{itemize}
\item Applies to non-linear dynamic systems.
\item Tiny changes in the initial conditions can have huge consequences in
the outcomes, even in a completely deterministic model.
\item This means measurement error, and human error can have huge
consequences in the predictions.
\item This is handled by perturbation of the initial conditions and simulation.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-4-4]{The Human Touch}
\begin{itemize}
\item It doesn't end there, there is still a human element to weather predictions.
\item Humans attempt to account for mistakes that the computer may make,
through their intuition about the machinations of the model.
\item This is true because humans are much better still at visually
identifying patterns and can correct for it much better than a
computer can.
\item This can lead to problems such as over fitting, but meteorologists
improve predictions by about 25\%, and predictions keep improving
\end{itemize}
\end{frame}

\begin{frame}[label=sec-2-4-5]{Evaluating a Forecast}
\begin{itemize}
\item Industry competition is not always seeking a more precise forecast,
but a more useful one.
\item The Economist's view on the Receiver Operating Curve.
\item This can lead to dishonest predictions that are not necessarily bad,
they simply are responding to other objectives.
\item Be aware of goals other than strictly reporting truth.
\end{itemize}
\end{frame}
