Behavioral/SignalNoise/SignalNoise.org
* Prediction - Where it really doesn't work
** Earthquakes

*** Not such a success story - Earthquakes
- Officially "cannot be predicted" - Only Forecasted
- While we know the long-term rates at which earthquakes hit and the
  probabilities of earthquakes of different intensities, we can't
  really tell anything in the short-term. 
- No real understanding of the mechanics that are working "under the
  hood"
- Data is relatively poor on anything but relatively powerful quakes
  in many places.

*** Purely Statistical Models Don't Work
- While aftershocks may be able to be predicted, especially involving
  movement down fault lines, we would like to predict the first shock.
- Without theory, you will simply be finding patterns in the noise. 
- It is impossible to identify the signal in data that is this noisy
  without knowing what it is you are looking for.
- This is different from weather prediction, since we understand the
  laws of motion there.
- It is too easy to over fit because of the noise and large amount of data.

*** Why they aren't working (and may never)
- The Data is extremely noisy. 
- "With four parameters I can fit an elephant, with five I can make
  him wiggle his trunk" - Von Veuman
- Making a model more complex often makes it worse.
- Non parametric fits that diverge from theory can be from over fitting
  and missing rare events
- Complex Process - Many simple actors combine for a very complicated process

** Economics
  
*** Economics - Not so good with the predictions
- Economists are very bad at predicting, and often don't the
  uncertainty of their forecasts
- Often too overconfident - Despite there being readily available
  feedback
- Predictions fail to be accurate or precise
- "Nobody has a clue" - Jan Hatzius 

*** Why do the predictions fail so badly
- The underlying processes are both dynamic and complex
- Cause and effect are extremely hard to determine
- The Data is horrible
- The Lucas Critique
- Goodhart's law - Targetting an indicator removes its predictive
  power

*** Structural Changes
- Since the economy is a complex dynamic system, it is changing over
  time.
- In particular becoming a global economy has shifted capital levels
- Baby boomers retiring, declining middle class and increased debt
  have all altered the way the American Economy works.
- Much of the recent growth during The Great Moderation was
  debt-fueled

*** Can these problems be handled?
- Don't throw out data - Silver claims the fed overvalued data from
  the Great Moderation to determine their forecasts
- To not throw out data is to assume there is no structural change
  over time, must make an assumption one way or another.
- How do we know when the economy has changed structurally? 

*** Why have many of the Problems been resolved in weather and not economics?
- There is no hard science to turn back to. 
- The structural approach which attempts this still has to make many
  unrealistic assumptions
- The system is far more complex 
- Agents are all individually making decisions.

*** Computers don't help
- They just give you faster and bigger ways to mistake the signal for
  the noise.
- Models need to be about the economics going on behind the scenes,
  not the data that is produced by the economics.
- Stories about data are still just made by hedgehogs, and are
  unlikely to be anything but over fitting noise.

*** Incentives
- Forecasters who do not have their names attached to forecasts
  usually do better
- They aren't trying to make a name for themselves or trying to stay
  conservative to damage established reputation.
- Market for predictions or changing how we consume forecasts?

** The Flu
*** Predictions can influence behavior
- Predictions can undermine themselves - GPS diverts all traffic and
  creates a bigger jam
- Economic Predictors of recessions make actually cause them
- Flu predictions can increase vaccinations and reduce flu damage

*** A Solution to Complex Systems?
- When systems are complex because of actors - they can be simulated
- However these simulations need all the actions of the actors
  predicted, often by models that are unreliable.
- Worse they can come from psychology, or just be made up by the
  creators.
- For now have relatively little predictive power and are very hard to
  test

* Predicting Better
** Thinking Bayesian
*** False Positives
- Bayes theorem tells us that if the underlying probability of
  something is very low then false positives can dominate the results.
- Tests that are 95% accurate for rare diseases can only be 10-30%
  sure that you have the disease. 
- Research is especially affected by this because of the bias for
  results and the "publish or die" mentality.

*** Fisherian vs Bayesians
- Frequentists take a strong stance on the structure of the problem
- This eliminates the prior, but also eliminates sources of error
  besides the sampling error
- Requires a sample and many other assumptions that give it
  computational tractability at the cost of rigidity.
- Since the prior is eliminated it eliminates context which takes the
  form of a Bayesian Prior.

*** Gambling
- Bob Voulgaris - Bayesian approach to betting - everything is looked
  at in the context of probabilities.
- No notion of statistical significance, so there is no arbitrary
  cutoff levels at 95%.
- When rewards are occurring at the margin, as is the case in almost
  all competitive predictive markets, this is the approach that is
  needed.
- Hypothesis are still tested and examined in the context of some
  theory, but not tested in the Null hypothesis framework.

*** Less structure means more work
- Since there is much less structure placed on the model, our beliefs
  weigh stronger into the prediction.
- But no matter what our prior beliefs are, with enough data we should
  still see our beliefs converge.
- The literature is also on the path towards Bayesian approaches and
  is "converging" there.

** Computers - Where they are useful and where they are not

*** Understand the underlying processes
- Computers have drastically helped weather prediction, where we
  understand the fluid dynamics that explain their machinations.
- Relatively useless at predicting things in Economics and Earthquakes
  where we don't understand the underlying process.

*** Computers work better with good data
- Computers are very likely to mistake the signal for the noise
- They lack the sight to see the big picture, and compensate by brute
  force and look-ahead algorithms with pruning.
- However they are still victims of the assumptions that their
  programmers have put on them.

** Poker 

*** Poker
- Pareto Principle - Diminishing returns to skill in poker
- Very noisy output - randomness plays a large role in returns
- Feeding on overconfidence of the fish.

