Behavioral/SignalNoise/SignalNoise.tex


\section{Prediction - Where it really doesn't work}
\label{sec-3}
\subsection{Earthquakes}
\label{sec-3-1}

\begin{frame}[label=sec-3-1-1]{Not such a success story - Earthquakes}
\begin{itemize}
\item Officially "cannot be predicted" - Only Forecasted
\item While we know the long-term rates at which earthquakes hit and the
probabilities of earthquakes of different intensities, we can't
really tell anything in the short-term.
\item No real understanding of the mechanics that are working "under the
hood"
\item Data is relatively poor on anything but relatively powerful quakes
in many places.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-1-2]{Purely Statistical Models Don't Work}
\begin{itemize}
\item While aftershocks may be able to be predicted, especially involving
movement down fault lines, we would like to predict the first shock.
\item Without theory, you will simply be finding patterns in the noise.
\item It is impossible to identify the signal in data that is this noisy
without knowing what it is you are looking for.
\item This is different from weather prediction, since we understand the
laws of motion there.
\item It is too easy to over fit because of the noise and large amount of data.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-1-3]{Why they aren't working (and may never)}
\begin{itemize}
\item The Data is extremely noisy.
\item "With four parameters I can fit an elephant, with five I can make
him wiggle his trunk" - Von Veuman
\item Making a model more complex often makes it worse.
\item Non parametric fits that diverge from theory can be from over fitting
and missing rare events
\item Complex Process - Many simple actors combine for a very complicated process
\end{itemize}
\end{frame}

\subsection{Economics}
\label{sec-3-2}

\begin{frame}[label=sec-3-2-1]{Economics - Not so good with the predictions}
\begin{itemize}
\item Economists are very bad at predicting, and often don't the
uncertainty of their forecasts
\item Often too overconfident - Despite there being readily available
feedback
\item Predictions fail to be accurate or precise
\item "Nobody has a clue" - Jan Hatzius
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-2-2]{Why do the predictions fail so badly}
\begin{itemize}
\item The underlying processes are both dynamic and complex
\item Cause and effect are extremely hard to determine
\item The Data is horrible
\item The Lucas Critique
\item Goodhart's law - Targetting an indicator removes its predictive
power
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-2-3]{Structural Changes}
\begin{itemize}
\item Since the economy is a complex dynamic system, it is changing over
time.
\item In particular becoming a global economy has shifted capital levels
\item Baby boomers retiring, declining middle class and increased debt
have all altered the way the American Economy works.
\item Much of the recent growth during The Great Moderation was
debt-fueled
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-2-4]{Can these problems be handled?}
\begin{itemize}
\item Don't throw out data - Silver claims the fed overvalued data from
the Great Moderation to determine their forecasts
\item To not throw out data is to assume there is no structural change
over time, must make an assumption one way or another.
\item How do we know when the economy has changed structurally?
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-2-5]{Why have many of the Problems been resolved in weather and not economics?}
\begin{itemize}
\item There is no hard science to turn back to.
\item The structural approach which attempts this still has to make many
unrealistic assumptions
\item The system is far more complex
\item Agents are all individually making decisions.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-2-6]{Computers don't help}
\begin{itemize}
\item They just give you faster and bigger ways to mistake the signal for
the noise.
\item Models need to be about the economics going on behind the scenes,
not the data that is produced by the economics.
\item Stories about data are still just made by hedgehogs, and are
unlikely to be anything but over fitting noise.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-2-7]{Incentives}
\begin{itemize}
\item Forecasters who do not have their names attached to forecasts
usually do better
\item They aren't trying to make a name for themselves or trying to stay
conservative to damage established reputation.
\item Market for predictions or changing how we consume forecasts?
\end{itemize}
\end{frame}

\subsection{The Flu}
\label{sec-3-3}
\begin{frame}[label=sec-3-3-1]{Predictions can influence behavior}
\begin{itemize}
\item Predictions can undermine themselves - GPS diverts all traffic and
creates a bigger jam
\item Economic Predictors of recessions make actually cause them
\item Flu predictions can increase vaccinations and reduce flu damage
\end{itemize}
\end{frame}

\begin{frame}[label=sec-3-3-2]{A Solution to Complex Systems?}
\begin{itemize}
\item When systems are complex because of actors - they can be simulated
\item However these simulations need all the actions of the actors
predicted, often by models that are unreliable.
\item Worse they can come from psychology, or just be made up by the
creators.
\item For now have relatively little predictive power and are very hard to
test
\end{itemize}
\end{frame}

\section{Predicting Better}
\label{sec-4}
\subsection{Thinking Bayesian}
\label{sec-4-1}
\begin{frame}[label=sec-4-1-1]{False Positives}
\begin{itemize}
\item Bayes theorem tells us that if the underlying probability of
something is very low then false positives can dominate the results.
\item Tests that are 95\% accurate for rare diseases can only be 10-30\%
sure that you have the disease.
\item Research is especially affected by this because of the bias for
results and the "publish or die" mentality.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-4-1-2]{Fisherian vs Bayesians}
\begin{itemize}
\item Frequentists take a strong stance on the structure of the problem
\item This eliminates the prior, but also eliminates sources of error
besides the sampling error
\item Requires a sample and many other assumptions that give it
computational tractability at the cost of rigidity.
\item Since the prior is eliminated it eliminates context which takes the
form of a Bayesian Prior.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-4-1-3]{Gambling}
\begin{itemize}
\item Bob Voulgaris - Bayesian approach to betting - everything is looked
at in the context of probabilities.
\item No notion of statistical significance, so there is no arbitrary
cutoff levels at 95\%.
\item When rewards are occurring at the margin, as is the case in almost
all competitive predictive markets, this is the approach that is
needed.
\item Hypothesis are still tested and examined in the context of some
theory, but not tested in the Null hypothesis framework.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-4-1-4]{Less structure means more work}
\begin{itemize}
\item Since there is much less structure placed on the model, our beliefs
weigh stronger into the prediction.
\item But no matter what our prior beliefs are, with enough data we should
still see our beliefs converge.
\item The literature is also on the path towards Bayesian approaches and
is "converging" there.
\end{itemize}
\end{frame}

\subsection{Computers - Where they are useful and where they are not}
\label{sec-4-2}

\begin{frame}[label=sec-4-2-1]{Understand the underlying processes}
\begin{itemize}
\item Computers have drastically helped weather prediction, where we
understand the fluid dynamics that explain their machinations.
\item Relatively useless at predicting things in Economics and Earthquakes
where we don't understand the underlying process.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-4-2-2]{Computers work better with good data}
\begin{itemize}
\item Computers are very likely to mistake the signal for the noise
\item They lack the sight to see the big picture, and compensate by brute
force and look-ahead algorithms with pruning.
\item However they are still victims of the assumptions that their
programmers have put on them.
\end{itemize}
\end{frame}

\subsection{Poker}
\label{sec-4-3}

\begin{frame}[label=sec-4-3-1]{Poker}
\begin{itemize}
\item Pareto Principle - Diminishing returns to skill in poker
\item Very noisy output - randomness plays a large role in returns
\item Feeding on overconfidence of the fish.
\end{itemize}
\end{frame}
