Behavioral/SignalNoise/SignalNoise.org
*** Tilting
- Tilting results from the fact that skill matters, but the game is
  still extremely noisy, and this can effect how we play.
- In all things avoid entitlement tilting - thinking that because you
  acted optimally, that you deserved to win.
- Don't be seduced by noisy positive results meaning that you are
  doing better
- Cannot evaluate predictions in noisy areas solely by right and
  wrong, have to evaluate the process.

** Group Forecasts

*** The Wisdom of Crowds
- Aggregation is incredibly powerful in certain situations
- However when people are reacting to other bets made, as is the case
  in a market, the dynamics are not as simple.
- The aggregate is only sometimes better than the best individual prediction.


* Vaguely Political Things

** Climate Science

*** Climate Prediction
- We understand the fundamental process that is heating the earth - The Greenhouse effect.
- However the primary cause for heating the earth isn't C0_2, its the
  water vapor stored in the air that becomes possible when the earth
  heats.
- While we understand the root cause very well, we are not very good
  at predicting temperatures.

*** Problems 
- Fancy models in the time from 1995-2012 were outperformed by a
  linear regression on C0_2 only.
- Complex systems that are influenced by lots of noise and cyclical
  trends like El Niño rarely perform well.
- Scott Armstrong bet Al Gore in 2007 that temperatures would not
  increase each month over the next Decade and won.
- Large structural uncertainty and initial condition uncertainty. 
- From 2001 to 2011 temperatures declined (though not by much)

*** A Bayessian Explanation
- Based on some prior belief of temperatures increasing, we can look
  at how our beliefs in global warming can change with a decade of
  temperatures decreasing.
- The more certain you are in your prior, the more hurt you are
  going to get by being wrong.
- 95% sure of Global warming updates to 85%
- 99% sure of Global warming updates to 28%.
- Overconfidence in something can reduce public faith when you are
  incorrect.

** Unknown Unknowns

*** Uncertainty is back
- When we are unfamiliar with a possibility, we don't even think about
  it happening.
- "there are also unknown unknowns ... things we do not know we don't
  know" - Donald Rumsfeld
- It can be very hard to sort and build theories of what we should be
  looking for when there isn't a solid theory to lean back on
- Failures of predicting 9/11 and Pearl Harbor.

* Conclusions

** Conclusion

*** In Summary
- Try to understand the theory underlying a process
- Think probabilistically and Bayesian
- Stay simple, but don't make so many assumptions that you lose
  predictive power
- Keep your incentives on getting predictions right, and do not trust
  those without the same incentives.




