Behavioral/SignalNoise/SignalNoise.tex

\begin{frame}[label=sec-4-3-2]{Tilting}
\begin{itemize}
\item Tilting results from the fact that skill matters, but the game is
still extremely noisy, and this can effect how we play.
\item In all things avoid entitlement tilting - thinking that because you
acted optimally, that you deserved to win.
\item Don't be seduced by noisy positive results meaning that you are
doing better
\item Cannot evaluate predictions in noisy areas solely by right and
wrong, have to evaluate the process.
\end{itemize}
\end{frame}

\subsection{Group Forecasts}
\label{sec-4-4}

\begin{frame}[label=sec-4-4-1]{The Wisdom of Crowds}
\begin{itemize}
\item Aggregation is incredibly powerful in certain situations
\item However when people are reacting to other bets made, as is the case
in a market, the dynamics are not as simple.
\item The aggregate is only sometimes better than the best individual prediction.
\end{itemize}
\end{frame}


\section{Vaguely Political Things}
\label{sec-5}

\subsection{Climate Science}
\label{sec-5-1}

\begin{frame}[label=sec-5-1-1]{Climate Prediction}
\begin{itemize}
\item We understand the fundamental process that is heating the earth - The Greenhouse effect.
\item However the primary cause for heating the earth isn't C0$_{\text{2}}$, its the
water vapor stored in the air that becomes possible when the earth
heats.
\item While we understand the root cause very well, we are not very good
at predicting temperatures.
\end{itemize}
\end{frame}

\begin{frame}[label=sec-5-1-2]{Problems}
\begin{itemize}
\item Fancy models in the time from 1995-2012 were outperformed by a
linear regression on C0$_{\text{2}}$ only.
\item Complex systems that are influenced by lots of noise and cyclical
trends like El Niño rarely perform well.
\item Scott Armstrong bet Al Gore in 2007 that temperatures would not
increase each month over the next Decade and won.
\item Large structural uncertainty and initial condition uncertainty.
\item From 2001 to 2011 temperatures declined (though not by much)
\end{itemize}
\end{frame}

\begin{frame}[label=sec-5-1-3]{A Bayessian Explanation}
\begin{itemize}
\item Based on some prior belief of temperatures increasing, we can look
at how our beliefs in global warming can change with a decade of
temperatures decreasing.
\item The more certain you are in your prior, the more hurt you are
going to get by being wrong.
\item 95\% sure of Global warming updates to 85\%
\item 99\% sure of Global warming updates to 28\%.
\item Overconfidence in something can reduce public faith when you are
incorrect.
\end{itemize}
\end{frame}

\subsection{Unknown Unknowns}
\label{sec-5-2}

\begin{frame}[label=sec-5-2-1]{Uncertainty is back}
\begin{itemize}
\item When we are unfamiliar with a possibility, we don't even think about
it happening.
\item "there are also unknown unknowns \ldots{} things we do not know we don't
know" - Donald Rumsfeld
\item It can be very hard to sort and build theories of what we should be
looking for when there isn't a solid theory to lean back on
\item Failures of predicting 9/11 and Pearl Harbor.
\end{itemize}
\end{frame}

\section{Conclusions}
\label{sec-6}

\subsection{Conclusion}
\label{sec-6-1}

\begin{frame}[label=sec-6-1-1]{In Summary}
\begin{itemize}
\item Try to understand the theory underlying a process
\item Think probabilistically and Bayesian
\item Stay simple, but don't make so many assumptions that you lose
predictive power
\item Keep your incentives on getting predictions right, and do not trust
those without the same incentives.
\end{itemize}
\end{frame}
% Emacs 25.1.1 (Org mode 8.2.10)
\end{document}